a) login to ise and get wwn -- assumes Volume has been created and assigned to host.
    oem:> show ise
	Identifier       : 2000001F93000110

b) Set up foreign target WWN and then force controller to discover ISE.
   CCBCL> vlinkctrlc				# See how many links already exist.
	  Number of remote controllers: 0	# Or however many vlinked controller ports are seen.
   CCBCL> genmrp -t byte 0x137 8 0f000000	# Turn on foreign target discovery allowance on all ports.
          A bunch of messages.
   CCBCL> resetqlogic fe 0
   CCBCL> resetqlogic fe 1
   CCBCL> resetqlogic fe 2
   CCBCL> resetqlogic fe 3
   CCBCL> vlinkctrlc
	  Number of remote controllers: 1

   NOTE: In /var/log/xiotech/apps.xiotech on controller, the following appears:
	tmt(0xafbaedc0)[2:0x01e4:0x0010e500:0x100100931F000020]:LUNS (3) <=> 0001  0002  0003 
   A few seconds after the "tmt" message, the CCB task will get the update, and
   then vlinkctrlc will show it. If the system is busy -- this can take quite a
   bit of time -- typically it should be done in about 15 seconds ...

c) NOTE that if both controllers fail and come back up -- within minutes, one may die and you are left with one running.


Example:
    oem:>
	create --volume=six6gb --size=6 --raid1 
	present --volume=six6gb m4ft
	create --volume=DSC_FE_Vol1 --size=20 --raid1 
	present --volume=DSC_FE_Vol1 m4ft
	create --volume="DataStore_ESX5i" --size=201
	present --volume="DataStore_ESX5i" m4ft
	create --volume="ESX5i_DataStore2" --size=201
	present --volume="ESX5i_DataStore2" m4ft      

    [0] 127.0.0.1:8628:7>
	genmrp -t byte 0x137 8 0f000000		# Turn on foreign target discovery on all ports.
	resetqlogic fe 0
	resetqlogic fe 1
	resetqlogic fe 2
	resetqlogic fe 3
	vlinkctrlc
	    Number of remote controllers: 1
    	vlinkctrli 0
	    Virtual Link Controller Information:
	      STATUS:                0x0
	      LEN:                   48
	      WWN:                   2000001f93000110
	      CONTROLLER NAME:       XIOTECH 
	      LUNS:                  1
	      CONTROLLER TYPE:       0x1
	      CLUSTER:               0
	      IP ADDRESS:            538976288
	      SERIAL NUMBER:         1414482264
	vlinkctrlv 0
	    Virtual Link Controller Virtual Disks:
	      STATUS:                0x0
	      LEN:                   6152
	      COUNT:                 4
	    ORDINAL  LUN  RTYPE  CLUSTER  ATTR  CAPACITY  SERIAL_NUM  VID1  VID2  SCNT  VLCNT  VDNAME
	    -------  ---  -----  -------  ----  --------  ----------  ----  ----  ----  -----  ------
		  0    1   0x00        0  0x00  8388608           0      1      0      0       0  
		  1    2   0x00        0  0x00  12582912           0      2      0      0       0  
		  2    3   0x00        0  0x00  419430399           0      3      0      0       0  
		  3    4   0x00        0  0x00  419430399           0      4      0      0       0  
